{"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 21, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_18", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_9", "inbound_nodes": [[["input_2", 0, 0, {}], ["conv2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_19", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_20", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_6", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims_6", "inbound_nodes": [["conv2d_19", 0, 0, {"axis": 3}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_7", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims_7", "inbound_nodes": [["conv2d_20", 0, 0, {"axis": 3}]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_6", "trainable": true, "batch_input_shape": [null, null, null, 21, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 21, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 13}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 14}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 15}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "conv_lstm2d_6", "inbound_nodes": [[["tf.expand_dims_6", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_7", "trainable": true, "batch_input_shape": [null, null, null, 21, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 21, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 18}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 19}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 20}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "conv_lstm2d_7", "inbound_nodes": [[["tf.expand_dims_7", 0, 0, {}]]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_6", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_6", "inbound_nodes": [["conv_lstm2d_6", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, 0, {"start": null, "stop": null, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_7", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_7", "inbound_nodes": [["conv_lstm2d_7", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, 0, {"start": null, "stop": null, "step": null}]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.leaky_relu_6", "trainable": true, "dtype": "float32", "function": "nn.leaky_relu"}, "name": "tf.nn.leaky_relu_6", "inbound_nodes": [["tf.__operators__.getitem_6", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.leaky_relu_7", "trainable": true, "dtype": "float32", "function": "nn.leaky_relu"}, "name": "tf.nn.leaky_relu_7", "inbound_nodes": [["tf.__operators__.getitem_7", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_8", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_8", "inbound_nodes": [["tf.nn.leaky_relu_6", 0, 0, {"y": [[0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0], [-1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0]], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_9", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_9", "inbound_nodes": [["tf.nn.leaky_relu_7", 0, 0, {"y": [[1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0], [1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0]], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.softmax_6", "trainable": true, "dtype": "float32", "function": "nn.softmax"}, "name": "tf.nn.softmax_6", "inbound_nodes": [["tf.__operators__.add_8", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.softmax_7", "trainable": true, "dtype": "float32", "function": "nn.softmax"}, "name": "tf.nn.softmax_7", "inbound_nodes": [["tf.__operators__.add_9", 0, 0, {}]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxYAAAB0AKABZAF8AGQCGQB8AGQDGQChA1MAKQROeg9udHZ3\nLG50d2MtPm50dmPpAAAAAOkBAAAAKQLaAnRm2gZlaW5zdW0pAdoBeKkAcgYAAAD6OC9jb250ZW50\nL2RyaXZlL015RHJpdmUvU1RHQ04tcmVoYWItbWFpbi9HQ04vc2djbl9sc3RtLnB52gg8bGFtYmRh\nPigAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "GCN.sgcn_lstm", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["tf.nn.softmax_6", 0, 0, {}], ["conv2d_19", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_7", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxYAAAB0AKABZAF8AGQCGQB8AGQDGQChA1MAKQROeg9udHZ3\nLG50d2MtPm50dmPpAAAAAOkBAAAAKQLaAnRm2gZlaW5zdW0pAdoBeKkAcgYAAAD6OC9jb250ZW50\nL2RyaXZlL015RHJpdmUvU1RHQ04tcmVoYWItbWFpbi9HQ04vc2djbl9sc3RtLnB52gg8bGFtYmRh\nPjEAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "GCN.sgcn_lstm", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_7", "inbound_nodes": [[["tf.nn.softmax_7", 0, 0, {}], ["conv2d_20", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_10", "inbound_nodes": [[["lambda_6", 0, 0, {}], ["lambda_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_21", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_13", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [15, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_22", "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_14", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [20, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_23", "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_15", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_11", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_11", "inbound_nodes": [[["dropout_13", 0, 0, {}], ["dropout_14", 0, 0, {}], ["dropout_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_24", "inbound_nodes": [[["concatenate_11", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_12", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_12", "inbound_nodes": [[["concatenate_11", 0, 0, {}], ["conv2d_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_25", "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_26", "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_8", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims_8", "inbound_nodes": [["conv2d_25", 0, 0, {"axis": 3}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_9", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims_9", "inbound_nodes": [["conv2d_26", 0, 0, {"axis": 3}]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_8", "trainable": true, "batch_input_shape": [null, null, null, 21, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 21, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 59}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 60}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 61}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "conv_lstm2d_8", "inbound_nodes": [[["tf.expand_dims_8", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_9", "trainable": true, "batch_input_shape": [null, null, null, 21, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 21, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 64}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 65}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 66}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "conv_lstm2d_9", "inbound_nodes": [[["tf.expand_dims_9", 0, 0, {}]]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_8", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_8", "inbound_nodes": [["conv_lstm2d_8", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, 0, {"start": null, "stop": null, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_9", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_9", "inbound_nodes": [["conv_lstm2d_9", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, {"start": null, "stop": null, "step": null}, 0, {"start": null, "stop": null, "step": null}]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.leaky_relu_8", "trainable": true, "dtype": "float32", "function": "nn.leaky_relu"}, "name": "tf.nn.leaky_relu_8", "inbound_nodes": [["tf.__operators__.getitem_8", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.leaky_relu_9", "trainable": true, "dtype": "float32", "function": "nn.leaky_relu"}, "name": "tf.nn.leaky_relu_9", "inbound_nodes": [["tf.__operators__.getitem_9", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_10", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_10", "inbound_nodes": [["tf.nn.leaky_relu_8", 0, 0, {"y": [[0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0], [-1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 0.0]], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_11", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_11", "inbound_nodes": [["tf.nn.leaky_relu_9", 0, 0, {"y": [[1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0], [1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0]], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.softmax_8", "trainable": true, "dtype": "float32", "function": "nn.softmax"}, "name": "tf.nn.softmax_8", "inbound_nodes": [["tf.__operators__.add_10", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.softmax_9", "trainable": true, "dtype": "float32", "function": "nn.softmax"}, "name": "tf.nn.softmax_9", "inbound_nodes": [["tf.__operators__.add_11", 0, 0, {}]]}, {"class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxYAAAB0AKABZAF8AGQCGQB8AGQDGQChA1MAKQROeg9udHZ3\nLG50d2MtPm50dmPpAAAAAOkBAAAAKQLaAnRm2gZlaW5zdW0pAdoBeKkAcgYAAAD6OC9jb250ZW50\nL2RyaXZlL015RHJpdmUvU1RHQ04tcmVoYWItbWFpbi9HQ04vc2djbl9sc3RtLnB52gg8bGFtYmRh\nPigAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "GCN.sgcn_lstm", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_8", "inbound_nodes": [[["tf.nn.softmax_8", 0, 0, {}], ["conv2d_25", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_9", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxYAAAB0AKABZAF8AGQCGQB8AGQDGQChA1MAKQROeg9udHZ3\nLG50d2MtPm50dmPpAAAAAOkBAAAAKQLaAnRm2gZlaW5zdW0pAdoBeKkAcgYAAAD6OC9jb250ZW50\nL2RyaXZlL015RHJpdmUvU1RHQ04tcmVoYWItbWFpbi9HQ04vc2djbl9sc3RtLnB52gg8bGFtYmRh\nPjEAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "GCN.sgcn_lstm", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_9", "inbound_nodes": [[["tf.nn.softmax_9", 0, 0, {}], ["conv2d_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_13", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_13", "inbound_nodes": [[["lambda_8", 0, 0, {}], ["lambda_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_27", "inbound_nodes": [[["concatenate_13", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_16", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [15, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_28", "inbound_nodes": [[["dropout_16", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_17", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [20, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_29", "inbound_nodes": [[["dropout_17", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_18", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_14", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_14", "inbound_nodes": [[["dropout_16", 0, 0, {}], ["dropout_17", 0, 0, {}], ["dropout_18", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_12", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_12", "inbound_nodes": [["concatenate_14", 0, 0, {"y": ["concatenate_11", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_30", "inbound_nodes": [[["tf.__operators__.add_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_15", "inbound_nodes": [[["tf.__operators__.add_12", 0, 0, {}], ["conv2d_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_31", "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_32", "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_10", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims_10", "inbound_nodes": [["conv2d_31", 0, 0, {"axis": 3}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_11", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims_11", "inbound_nodes": [["conv2d_32", 0, 0, {"axis": 3}]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lstm2d_10", "trainable": true, "batch_input_shape": [null, null, null, 21, 1, 3], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 21, 